50. Machine Learning.

1.	What is the difference between Series & Dataframes.

In [54]:
#Series 
import pandas as pd 
my_list = [10,20,30,40]
my_series = pd.Series(my_list)
print(my_series)

0    10
1    20
2    30
3    40
dtype: int64

In [56]:
#DataFrame
data = {
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [25, 30, 33]
}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   33

2.	Create a database name Travel_Planner in mysql ,and  create a table name bookings in that which having attributes (user_id INT,  flight_id INT,hotel_id INT, activity_id INT,booking_date DATE) . Fill with some dummy value .Now you have to read the content of this table using pandas as dataframe. Show the output.

In [2]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine("mysql+pymysql://root:tak.praveen852@localhost:3306/travel_planner")
df = pd.read_sql_table("bookings", engine)
df

   user_id  flight_id  hotel_id  activity_id booking_date
0     1234     852456    321654       789456   2022-12-12
1     4567     951753    789122       456853   2023-07-25
2     6789     456741    524163       753965   2023-12-10
3     9123     963456    748596       456225   2024-01-30
4     5263     852789    636529       456897   2024-02-14

3.	Difference between loc and iloc.

In [69]:
import pandas as pd
data = {
    'A' : [10,20,30],
    'B' : [40,50,60]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
print(df)
print()
print(df.loc['row1','B'])
print()
print(df.iloc[0,1])

       A   B
row1  10  40
row2  20  50
row3  30  60

40

40